experiments/torch-geometry/cfd/e0a_source/system/blockMeshDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object blockMeshDict;
}

scale   1;
vertices
(
    (0    0       0)
    (0.10 0       0)
    (0.10 0.0085 -0.000371119)
    (0    0.0085 -0.000371119)
    (0.10 0.0085  0.000371119)
    (0    0.0085  0.000371119)
);
blocks ( hex (0 1 2 3 0 1 4 5) (200 40 1) simpleGrading (1 1 1) );
edges ();
boundary
(
    inlet  { type patch; faces ( (0 3 5 0) ); }
    outlet { type patch; faces ( (1 1 4 2) ); }
    wall   { type wall;  faces ( (3 2 4 5) ); }
    front  { type wedge; faces ( (0 1 4 5) ); }
    back   { type wedge; faces ( (0 3 2 1) ); }
);
